/* Toolbar item */
"Action" = "การดำเนินการ";
"Active" = "ทำงาน";

/* Window title. */
"Activity" = "Activity";
"Allow" = "อนุญาติ";
"Always" = "เสมอ";

/* Transfer action for existing files */
"Prompt" = "ถามฉันก่อนว่าจะทำอะไร";

/* Toolbar item */
"{0} Bookmarks" = "{0} ที่คั่นหน้า";

/* Alert sheet alternate button */
"Cancel" = "ยกเลิก";

/* Toolbar item tooltip */
"Character Encoding" = "รหัสอักขระ";
"Choose" = "เลือก";

/* Toolbar item in Transfer Window. */
"Clean Up" = "ทำความสะอาด";

/* Remove all bookmarks from history. */
"Clear Menu" = "Clear Menu";

/* Toolbar item */
"Column" = "คอลัมน์";

/* Toolbar item tooltip */
"Connect to server" = "เชื่อมต่อไปยังเซอร์เวอร์";

/* Copy {FTP|Web|Distribution} URL */
"{0} URL" = "{0} URL";

/* Alert sheet text */
"Could not open or read the host file" = "ไม่สามารถเปิดหรืออ่านไฟล์ที่โฮสต์ได้";
"Could not open the file" = "ไม่สามารถเปิดไฟล์ได้";
"Could not show the file" = "ไม่สามารถแสดงไฟล์ได้";
"Could not show the file in the Finder" = "ไม่สามารถแสดงไฟล์ใน Finder ได้";

/* Toolbar item tooltip */
"Create New Folder" = "สร้างโฟลเดอร์ใหม่";

/* Menu item */
"Cut {0}" = "ตัด {0}";
"Copy {0}" = "Copy {0}";
"Default" = "ค่าปริยาย";

/* Alert sheet title
   Alert sheet default button
   Toolbar item */
"Delete" = "ลบ";
"Delete Bookmark" = "ลบที่คั่นหน้า";

/* Toolbar item tooltip */
"Delete file" = "ลบไฟล์";
"Deny" = "ปฏิเสธ";

/* Alert sheet default button
   Toolbar item */
"Disconnect" = "ยกเลิกการเชื่อมต่อ";

/* Alert sheet title */
"Disconnect from {0}" = "ยกเลิกการเชื่อมต่อกับ {0}";

/* Toolbar item tooltip */
"Disconnect from server" = "ยกเลิกการเชื่อมต่อกับเซอร์เวอร์";
"Do you want to delete the selected bookmark?" = "คุณต้องการลบที่คั่นหน้าที่เลือกไว้หรือไม่?";

/* Toolbar item */
"Download" = "ดาวโหลด";
"Download As:" = "ดาวโหลดเป็น:";

/* Toolbar item tooltip */
"Download file" = "ดาวโหลดไฟล์";
"Download the selected file to…" = "ดาวโหลดไฟล์ที่เลือกไปยัง…";

/* Toolbar item */
"Edit" = "แก้ไข";

/* Toolbar item tooltip */
"Edit file in external editor" = "แก้ไขไฟล์โดยตัวแก้ไขภายนอก";

/* Toolbar item */
"Encoding" = "รหัสอักขระ";

/* Alert sheet title */
"Error" = "ผิดพลาด";

/* Quit application on Windows */
"Exit" = "Exit";
"File" = "ไฟล์";

/* A column in the browser */
"Filename" = "ชื่อไฟล์";
"{0} Items" = "{0} ไฟล์";
"Folder" = "โฟลเดอร์";
"FTP (File Transfer Protocol)" = "FTP (File Transfer Protocol)";
"FTPS (FTP/SSL)" = "FTP-SSL (FTP บน TLS/SSL)";

/* Toolbar item */
"Get Info" = "เรียกดูข้อมูล";

/* Toolbar item */
"Go to Folder" = "ไปที่โฟลเดอร์";
"History" = "ประวัติ";

"Invalid character in filename." = "ชื่อไฟล์มีตัวอักษรไม่ถูกต้อง";
"Invalid character in folder name." = "ชื่อโฟลเดอร์มีตัวอักษรไม่ถูกต้อง";

/* A column in the browser */
"Kind" = "ประเภท";
"Extension" = "Extension";
"Region" = "Region";
"Version" = "Version";

/* Toolbar item */
"List" = "รายการ";
"Local" = "ฝั่งนี้";
"Local File" = "ไฟล์ฝั่งนี้";
"Mac Line Endings (CR)" = "จบบรรทัดแบบแมค (CR)";

/* A column in the browser */
"Modified" = "ถูกแก้ไข";

/* Move a downloaded file to the trash */
"Move to Trash" = "Move to Trash";
"Multiple files" = "หลายไฟล์";

/* Toolbar item */
"New Connection" = "การเชื่อมต่อใหม่";

/* Toolbar item */
"No external editor available" = "ไม่มีตัวแก้ไขภายนอก";

/* Alert sheet text */
"No newer version available." = "ไม่มีเวอร์ชั่นที่ใหม่กว่านี้";
"No private key selected" = "กุญแจสาธารณะไม่ได้ถูกเลือก";
/* Alert sheet title */
"No update" = "ไม่มีการปรับปรุง";
"None" = "ไม่มี";

/* 1.2MB of 3.4MB */
"{0} of {1}" = "{0} จาก {1}";

/* Alert default button
   Alert sheet default button */
"OK" = "ตกลง";
"Open" = "เปิด";

/* Open corresponding HTTP URL in default browser tooltip */
"Open in Web Browser" = "Open in Web Browser";

/* Toolbar item */
"Outline" = "เค้าโครง";

/* A column in the browser */
"Owner" = "เจ้าของ";

/* A column in the browser */
"Group" = "กลุ่ม";
"Passive" = "Passive";

/* Menu item */
"Paste {0}" = "วาง {0}";

/* A column in the browser */
"Permissions" = "การอนุญาต";

/* Toolbar item */
"Quick Connect" = "เชื่อมต่อแบบเร็ว";

/* Toolbar item */
"Quick Look" = "Quick Look";
"Quit" = "ออก";
"Quit Anyway" = "ออกทันที";

/* Confirm deleting files. */
"Delete {0} files" = "ต้องการจะลบไฟล์ดังกล่าวจริงๆ หรือไม่เพราะเมื่อลบไปแล้วจะไม่สามารถเรียกคืนได้";

/* Toolbar item */
"Refresh" = "แสดงผลใหม่";

/* Toolbar item tooltip */
"Refresh directory listing" = "แสดงผลรายการไดเรกทอรี่ใหม่";

/* Toolbar item in Transfer Window. */
"Reload" = "โหลดใหม่";

/* Toolbar item in Transfer Window. */
"Remove" = "เอาออก";
"Remove completed transfers from list." = "Remove completed transfers from list.";


"Review…" = "ตรวจทาน…";

/* Toolbar item in Transfer Window. */
"Search" = "Search";
"Server File" = "เซอร์เวอร์ไฟล์";
"SFTP (SSH File Transfer Protocol)" = "SFTP (SSH File Transfer Protocol)";
"Show" = "แสดง";

/* Toolbar item tooltip */
"Show file attributes" = "แสดงคุณลักษณะของไฟล์";
"Show in Finder" = "แสดงใน Finderr";

/* Toolbar item tooltip */
"Show Transfers window" = "แสดงหน้าต่างถ่ายโอน";

/* A column in the browser */
"Size" = "ขนาด";

/* Toolbar item in Transfer Window. */
"Stop" = "หยุด";

/* Toolbar item tooltip */
"Switch Browser View" = "สลับมุมมองเบราเซอร์";
"Symbolic Link (File)" = "Symbolic Link (ไฟล์)";
"Symbolic Link (Folder)" = "Symbolic Link (โฟลเดอร์)";

/* Toolbar item */
"Synchronize {0} with" = "ซิงโครไนซ์ {0}";

/* Toolbar item tooltip */
"Synchronize files" = "ซิงโครไนซ์แฟ้ม";

/* Alert sheet text */
"The connection will be closed." = "การเชื่อมต่อจะถูกปิด";
"There are files currently being transferred. Quit anyway?" = "ยังคงมีงานค้างอยู่ในคิว ต้องการออกจากโปรแกรมหรือไม่?";

/* Alert sheet text */
"There was a problem checking for an update. Please try again later." = "เกิดปัญหาขึ้นขณะตรวจสอบการอัพเดท กรุณาลองใหม่อีกครั้ง";

/* Toolbar item tooltip */
"Toggle Bookmarks" = "สลับที่คั่นหน้า";
"Transfer in progress" = "กำลังถ่ายโอน";

/* Toolbar item */
"Transfers" = "ถ่ายโอน";

"Auto" = "Auto";
"Unknown" = "ไม่ทราบ";
"Unknown size" = "ไม่ทราบขนาด";

/* Toolbar item */
"Upload" = "อัพโหลด";

/* Toolbar item tooltip */
"Upload local file to the remote host" = "อัพโหลดไฟล์จากเครื่องนี้ไปโฮสต์ปลายทาง";

/* Toolbar item */
"View" = "มุมมอง";

"You are connected to at least one remote site. Do you want to review open browsers?" = "คุณกำลังเชื่อมต่อโฮสต์อยู่อย่างน้อยหนึ่งโฮสต์ คุณต้องการที่จะตรวจสอบดูเบราเซอร์ที่เปิดอยู่หรือไม่?";
"Open Network Diagnostics" = "Open Network Diagnostics";
"WebDAV (Web-based Distributed Authoring and Versioning)" = "WebDAV (Web-based Distributed Authoring and Versioning)";
"WebDAV (HTTP/SSL)" = "WebDAV (HTTP/SSL)";

/* Update sources */
"Release" = "Release";
"Beta" = "Beta";
"Snapshot Builds" = "Snapshot Builds";

"Show Hidden Files" = "แสดงไฟล์ที่ซ่อนอยู่";

/* Toggle Toolbar on Windows */
"Hide Toolbar" = "Hide Toolbar";
"Show Toolbar" = "Show Toolbar";
